НВ_Доработки/DataProcessors/СБПБанкТочка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>СБПБанкТочка</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>qrcId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Comment>NotStarted - операции по QR-коду не существует, Received - операция в обработке, InProgress - операция в обработке, Accepted - операция завершена успешно, Rejected - операция отклонена</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаГенерации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>imageParams_width</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>imageParams_height</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>imageParams_mediaType</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>imageParams_content</Name>
					<Comment>содержимое изображения (для image/png - в кодировке base64)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>payload</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>qrcType</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

НВ_Доработки/InformationRegisters/СБП_QRКоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СБП_QRКоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>status</Name>
					<Comment>CREATED, BLOCKED, NOT_STARTED, ACCEPTED, REJECTED, RECEIVED</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаГенерации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>imageParams_mediaType</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>imageParams_content</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>amount</Name>
					<Comment>Сумма операции в копейках</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>payload</Name>
					<Comment>Payload зарегистрированного QR кода в СБП</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>qrcType</Name>
					<Comment>Тип QR кода: 01 - Статический QR-код, 02 - Динамический QR-код (QR на кассе), 03 - QR-код для привязки счета Плательщика (подписки)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоступлениеНаРС</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>imageParams_height</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>imageParams_width</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>qrcId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

НВ_Доработки/AccumulationRegisters/РасчетыПоЗаказам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>РасчетыПоЗаказам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Заказ</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

НВ_Доработки/DataProcessors/СБПБанкТочка/Ext/ObjectModule.bsl
#Область Блок_получения_и_обновления_токена_Банка_Точка

Функция ОбновитьТокенAPIБанкТочка(НаборКлючей) Экспорт
	
	СтрокаЗапроса = "connect/token";
	
	СтрокаBodyParametrs = "client_id=" + НаборКлючей.sbp_client_id + "&client_secret=" + НаборКлючей.sbp_client_secret + "&grant_type=refresh_token&refresh_token=" + НаборКлючей.sbp_refreshtoken_hybrid;
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type", "application/x-www-form-urlencoded");
	ЗаголовокHTTP.Вставить("accept", "application/json");
	ЗаголовокHTTP.Вставить("type", "POST");
	ЗаголовокHTTP.Вставить("dataType", "json");
	
	Попытка
		//Соединение = Новый HTTPСоединение("enter.tochka.com", 443,,,,,Новый ЗащищенноеСоединениеOpenSSL); 
		//Соединение = Новый HTTPСоединение(НаборКлючей.sbp_url_service, НаборКлючей.sbp_port_service,,,,,Новый ЗащищенноеСоединениеOpenSSL);
		//HTTPЗапрос = Новый HTTPЗапрос(СтрокаЗапроса, ЗаголовокHTTP);
		//HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаBodyParametrs, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
		//ОтветСервера = Соединение.ОтправитьДляОбработки(HTTPЗапрос);   
		HTTPОтвет = БОНД_Коннектор.Post("https://" + НаборКлючей.sbp_url_service + "/" + СтрокаЗапроса, СтрокаBodyParametrs, Новый Структура("Заголовки",ЗаголовокHTTP)); 		
	Исключение
		ТекстОшибки = "Связь с сервером не установлена " + ОписаниеОшибки() + "";
		Сообщить(ТекстОшибки, СтатусСообщения.Важное);
		ЗаписьЖурналаРегистрации(ТекстОшибки, УровеньЖурналаРегистрации.Ошибка);
	КонецПопытки;
	
	ОтветСтрокой = БОНД_Коннектор.КакТекст(HTTPОтвет);
	
	//ОтветСтрокой = ОтветСервера.ПолучитьТелоКакСтроку("UTF-8");
	
	Текст = "Запрос Точка банк. Получение выписки. Код состояния: " + HTTPОтвет.КодСостояния + ". Входящая информация: " + ОтветСтрокой + "";
	
	Ответ = ОпределитьОтвет(HTTPОтвет, Текст, ОтветСтрокой);
	
	НаборКлючей.sbp_refreshtoken_hybrid = Ответ.refresh_token; 
	
	НаборКлючей.sbp_accesstoken_hybrid = Ответ.access_token;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Константы.НВД_sbp_refreshtoken_hybrid.Установить(НаборКлючей.sbp_refreshtoken_hybrid);
	Константы.НВД_sbp_accesstoken_hybrid.Установить(НаборКлючей.sbp_accesstoken_hybrid);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат НаборКлючей;
	
	
КонецФункции	

#КонецОбласти

#Область QR_коды_для_оплаты_через_СБП      

Функция ПолучитьНаборКлючейДляСБП() Экспорт 
	
	НаборКлючей = Новый Структура();
	НаборКлючей.Вставить("sbp_accesstoken_hybrid", Константы.НВД_sbp_accesstoken_hybrid.Получить()); 
	НаборКлючей.Вставить("sbp_accesstoken_client", Константы.НВД_sbp_accesstoken_client.Получить());
	НаборКлючей.Вставить("sbp_refreshtoken_hybrid", Константы.НВД_sbp_refreshtoken_hybrid.Получить());
	НаборКлючей.Вставить("sbp_client_id", Константы.НВД_sbp_client_id.Получить());
	НаборКлючей.Вставить("sbp_client_secret", Константы.НВД_sbp_client_secret.Получить());
	БанкДляСБПТочкаБанк = Константы.НВД_ОсновнойБанковскийСчетДляСБП.Получить();
	sbp_account_code = "" + БанкДляСБПТочкаБанк.НомерСчета + "/" + БанкДляСБПТочкаБанк.БИК;
	//sbp_account_code = "12345678901234567890/044525104";
	НаборКлючей.Вставить("sbp_account_code", sbp_account_code);
	НаборКлючей.Вставить("sbp_merchant_id", Константы.НВД_sbp_merchant_id.Получить());
	НаборКлючей.Вставить("sbp_legalId", Константы.НВД_sbp_legalId.Получить());
	НаборКлючей.Вставить("sbp_customerCode", Константы.НВД_sbp_customerCode.Получить());
	НаборКлючей.Вставить("sbp_callback", Константы.НВД_sbp_callback.Получить());
	НаборКлючей.Вставить("sbp_url_service", Константы.НВД_sbp_url_service.Получить());
	НаборКлючей.Вставить("sbp_port_service", Константы.НВД_sbp_port_service.Получить());	
	НаборКлючей.Вставить("sbp_type_service", Константы.НВД_sbp_type_service.Получить()); 
	
	Возврат НаборКлючей;
	
КонецФункции

Процедура ЗаписатьНовыйНаборКлючейСБП(НаборКлючей) Экспорт 
	
	Константы.НВД_sbp_accesstoken_hybrid.Установить(НаборКлючей.sbp_accesstoken_hybrid);
	Константы.НВД_sbp_accesstoken_client.Установить(НаборКлючей.sbp_accesstoken_client);
	Константы.НВД_sbp_refreshtoken_hybrid.Установить(НаборКлючей.sbp_refreshtoken_hybrid);
	Константы.НВД_sbp_client_id.Установить(НаборКлючей.sbp_client_id);
	Константы.НВД_sbp_client_secret.Установить(НаборКлючей.sbp_client_secret);
	//Константы.НВД_sbp_account_code.Установить(НаборКлючей.sbp_account_code);
	Константы.НВД_sbp_merchant_id.Установить(НаборКлючей.sbp_merchant_id);
	Константы.НВД_sbp_legalId.Установить(НаборКлючей.sbp_legalId);
	Константы.НВД_sbp_customerCode.Установить(НаборКлючей.sbp_customerCode);
	
КонецПроцедуры

Функция ОбновитьСтатусыQRКодов() Экспорт
	
	БанкДляСБПТочкаБанк = Константы.НВД_ОсновнойБанковскийСчетДляСБП.Получить();
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборКлючей = ПолучитьНаборКлючейДляСБП();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Данные = Новый Структура("НаборКлючей", НаборКлючей);
	
	СтарыйНаборКлючей = ЗначениеИзСтрокиВнутр(ЗначениеВСтрокуВнутр(НаборКлючей)); //запомним набор ключей, чтобы потом проверить на изменении
	//
	//ТекстС = "Запуск API Точка банк. Запрос QR - кода";
	////Сообщить(ТекстС);
	//ЗаписьЖурналаРегистрации(ТекстС, УровеньЖурналаРегистрации.Информация);
	//
	////Get Qr Codes List https://enter.tochka.com/uapi/sbp/{apiVersion}/qr-code/legal-entity/{legalId}
	//СтрокаЗапроса = Данные.НаборКлючей.sbp_type_service + "/sbp/v1.0/qr-code/legal-entity/" + Данные.НаборКлючей.sbp_legalId + "";	
	//
	//СтрокаJSON = СформироватьСтрокуJSONИзСтруктуры(Новый Структура);
	//
	//HTTPОтвет = ПолучитьЗапрошенныйФайлPOST(СтрокаЗапроса, СтрокаJSON, "GET", Данные.НаборКлючей.sbp_accesstoken_hybrid, Данные.НаборКлючей.sbp_account_code, НаборКлючей.sbp_url_service, НаборКлючей.sbp_port_service);
	//
	////ОтветСтрокой = HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8");
	//
	//ОтветСтрокой = БОНД_Коннектор.КакТекст(HTTPОтвет);
	//
	//Текст = "Запрос Точка банк. Получение списка QR-кодов. Код состояния: " + HTTPОтвет.КодСостояния + ". Входящая информация: " + ОтветСтрокой + "";
	//
	//Ответ = ОпределитьОтвет(HTTPОтвет, Текст, ОтветСтрокой);
	//
	//Если СтрНайти(ОтветСтрокой,"token is missing") > 0 Тогда //токен не рабочий, обновляем его
	//	
	//	Данные.НаборКлючей = ЗначениеИзСтрокиВнутр(ЗначениеВСтрокуВнутр(ОбновитьТокенAPIБанкТочка(Данные.НаборКлючей)));
	//	
	//	HTTPОтвет = ПолучитьЗапрошенныйФайлPOST(СтрокаЗапроса, СтрокаJSON, "GET", Данные.НаборКлючей.sbp_accesstoken_hybrid, Данные.НаборКлючей.sbp_account_code, НаборКлючей.sbp_url_service, НаборКлючей.sbp_port_service);
	//	
	//	//ОтветСтрокой = HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8");
	//	
	//	ОтветСтрокой = БОНД_Коннектор.КакТекст(HTTPОтвет);
	//	
	//	Текст = "Запрос Точка банк. Получение списка QR-кодов. Код состояния: " + HTTPОтвет.КодСостояния + ". Входящая информация: " + ОтветСтрокой + "";
	//	
	//	Ответ = ОпределитьОтвет(HTTPОтвет, Текст, ОтветСтрокой);
	//	
	//КонецЕсли; 
	AllqrCodesNotAccepted = ПолучитьМассивВсехНеОплаченныхQRКодов();
	//получаем список QR-кодов, чтобы получить по ним статусы 
	
	//Пока ИСТИНА Цикл
	
	Пока AllqrCodesNotAccepted.Количество() > 0 Цикл
		
		qrCodeList = Новый Массив;
		А = 1;
		Пока AllqrCodesNotAccepted.Количество() > 0 Цикл  //получаем порцию 50 штук
			Если А%50 = 0 Тогда
				Прервать;
			Иначе	
				qrCodeList.Добавить(AllqrCodesNotAccepted[AllqrCodesNotAccepted.Количество()-1]);
				AllqrCodesNotAccepted.Удалить(AllqrCodesNotAccepted.Количество()-1);
			КонецЕсли;
			А = А + 1;
		КонецЦикла;	
		
		МассивQRКодов = Новый Массив;
		//Для Каждого QRКод Из Ответ.Data.qrCodeList Цикл 
		Для Каждого QRКод Из qrCodeList Цикл
			//Если QRКод.qrcType = "01" Тогда //статичный qr код, у него нету статусов оплаты
			//	Продолжить;
			//КонецЕсли;
			//Если QRКод.qrcId = "" Тогда 
			//	Продолжить;
			//КонецЕсли;
			//МассивQRКодов.Добавить(QRКод.qrcId);
			МассивQRКодов.Добавить(QRКод);
			МассивQRКодов.Добавить(",");
		КонецЦикла;
		
		Если МассивQRКодов.Количество() > 0 Тогда //удалим последнюю запятую
			МассивQRКодов.Удалить(МассивQRКодов.Количество()-1);
		КонецЕсли;	
		
		Если МассивQRКодов.Количество() > 0 Тогда 
			
			qrc_ids = СтрСоединить(МассивQRКодов);
			
			
			//делаем запрос статусов по списку QR-кодов
			
			ТекстС = "Запуск API Точка банк. Запрос статусов QR - кодов";
			//Сообщить(ТекстС);
			ЗаписьЖурналаРегистрации(ТекстС, УровеньЖурналаРегистрации.Информация);
			
			//Get Qr Codes Payment Status https://enter.tochka.com/uapi/sbp/{apiVersion}/qr-code/legal-entity/{legalId}
			СтрокаЗапроса = Данные.НаборКлючей.sbp_type_service + "/sbp/v1.0/qr-codes/" + qrc_ids + "/payment-status";	
			//uapi/sbp/{apiVersion}/qr-codes/{qrc_ids}/payment-status
			СтрокаJSON = СформироватьСтрокуJSONИзСтруктуры(Новый Структура);
			
			HTTPОтвет = ПолучитьЗапрошенныйФайлPOST(СтрокаЗапроса, СтрокаJSON, "GET", Данные.НаборКлючей.sbp_accesstoken_hybrid, Данные.НаборКлючей.sbp_account_code, Данные.НаборКлючей.sbp_url_service, Данные.НаборКлючей.sbp_port_service);
			
			//ОтветСтрокой = HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8");
			
			ОтветСтрокой = БОНД_Коннектор.КакТекст(HTTPОтвет);
			
			Текст = "Запрос Точка банк. Получение QR-кода. Код состояния: " + HTTPОтвет.КодСостояния + ". Входящая информация: " + ОтветСтрокой + "";
			
			ОтветPaymentStatus = ОпределитьОтвет(HTTPОтвет, Текст, ОтветСтрокой);
			
			//делаем проверку времени жизни токена, оно могло уже закончится
			Если СтрНайти(ОтветСтрокой,"token is missing") > 0 Тогда //токен не рабочий, обновляем его
				
				Данные.НаборКлючей = ЗначениеИзСтрокиВнутр(ЗначениеВСтрокуВнутр(ОбновитьТокенAPIБанкТочка(Данные.НаборКлючей)));
				
				HTTPОтвет = ПолучитьЗапрошенныйФайлPOST(СтрокаЗапроса, СтрокаJSON, "GET", Данные.НаборКлючей.sbp_accesstoken_hybrid, Данные.НаборКлючей.sbp_account_code, Данные.НаборКлючей.sbp_url_service, Данные.НаборКлючей.sbp_port_service);
				
				//ОтветСтрокой = HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8");
				
				ОтветСтрокой = БОНД_Коннектор.КакТекст(HTTPОтвет);
				
				Текст = "Запрос Точка банк. Получение статусов QR - кодов. Код состояния: " + HTTPОтвет.КодСостояния + ". Входящая информация: " + ОтветСтрокой + "";
				
				ОтветPaymentStatus = ОпределитьОтвет(HTTPОтвет, Текст, ОтветСтрокой);
				
			КонецЕсли;
			
			Если НЕ ОтветPaymentStatus.Свойство("Data") Тогда
				СтатусыПолучены = Ложь;
			Иначе
				СтатусыПолучены = Истина;
				ТЗQRКодовСоСтатусами = Новый ТаблицаЗначений;
				ТЗQRКодовСоСтатусами.Колонки.Добавить("qrcId");
				ТЗQRКодовСоСтатусами.Колонки.Добавить("Статус");
				Для Каждого QRКодСоСтатусом Из ОтветPaymentStatus.Data.paymentList Цикл
					СтрокаТЗQRКодСоСтатусом = ТЗQRКодовСоСтатусами.Добавить();
					СтрокаТЗQRКодСоСтатусом.qrcId = QRКодСоСтатусом.qrcId;
					Если QRКодСоСтатусом.Свойство("status") Тогда
						СтрокаТЗQRКодСоСтатусом.Статус = QRКодСоСтатусом.status;
					Иначе
						СтрокаТЗQRКодСоСтатусом.Статус = "NotStarted";
					КонецЕсли;	
				КонецЦикла;	
			КонецЕсли;	
			
			//Для Каждого QRКод Из Ответ.Data.qrCodeList Цикл
			Для Каждого QRКод Из qrCodeList Цикл
				//Если QRКод.qrcType = "01" Тогда //статичный qr код, у него нету статусов оплаты
				//	Продолжить;
				//КонецЕсли;
				
				МенеджерЗаписи = РегистрыСведений.СБП_QRКоды.СоздатьМенеджерЗаписи();
				//МенеджерЗаписи.qrcId = QRКод.qrcId;
				МенеджерЗаписи.qrcId = QRКод;
				МенеджерЗаписи.Прочитать();		
				Если НЕ МенеджерЗаписи.Выбран() Тогда				
					//Добавить новую запись
					//МенеджерЗаписи.qrcId = QRКод.qrcId; 
					//МенеджерЗаписи.qrcId = QRКод;
					//Если СтатусыПолучены Тогда
					//	//СтрокаТЗQRКодСоСтатусом = ТЗQRКодовСоСтатусами.Найти(QRКод.qrcId, "qrcId");
					//	СтрокаТЗQRКодСоСтатусом = ТЗQRКодовСоСтатусами.Найти(QRКод, "qrcId");
					//	Если НЕ СтрокаТЗQRКодСоСтатусом = Неопределено Тогда
					//		МенеджерЗаписи.status = СтрокаТЗQRКодСоСтатусом.Статус; //тут статус платежа, смотреть надо Get Qr Codes Payment Status
					//	Иначе
					//		МенеджерЗаписи.status = "NOT_STARTED";
					//	КонецЕсли;
					//КонецЕсли;
					//МенеджерЗаписи.ДатаГенерации = ПолучитьДатуИзСтроки(QRКод.createdAt); // поправить формат даты
					//МенеджерЗаписи.imageParams_width = QRКод.image.width;
					//МенеджерЗаписи.imageParams_height = QRКод.image.height;
					//МенеджерЗаписи.imageParams_mediaType = QRКод.image.mediaType;
					//Хранилище = Новый ХранилищеЗначения(QRКод.image.content, Новый СжатиеДанных());
					//МенеджерЗаписи.imageParams_content = Хранилище;
					//МенеджерЗаписи.payload = QRКод.payload;
					//МенеджерЗаписи.qrcType = QRКод.qrcType;				
				Иначе		
					//Изменить существующую запись
					Если СтатусыПолучены Тогда
						//СтрокаТЗQRКодСоСтатусом = ТЗQRКодовСоСтатусами.Найти(QRКод.qrcId, "qrcId"); 
						СтрокаТЗQRКодСоСтатусом = ТЗQRКодовСоСтатусами.Найти(QRКод, "qrcId");
						Если НЕ СтрокаТЗQRКодСоСтатусом = Неопределено Тогда
							МенеджерЗаписи.status = СтрокаТЗQRКодСоСтатусом.Статус; //тут статус платежа, смотреть надо Get Qr Codes Payment Status
						Иначе
							МенеджерЗаписи.status = "NOT_STARTED";
						КонецЕсли;
					КонецЕсли;
					//МенеджерЗаписи.ДатаГенерации = ПолучитьДатуИзСтроки(QRКод.createdAt);
					//МенеджерЗаписи.imageParams_width = QRКод.image.width;
					//МенеджерЗаписи.imageParams_height = QRКод.image.height;
					//МенеджерЗаписи.imageParams_mediaType = QRКод.image.mediaType;
					//Хранилище = Новый ХранилищеЗначения(QRКод.image.content, Новый СжатиеДанных());
					//МенеджерЗаписи.imageParams_content = Хранилище;
					//МенеджерЗаписи.payload = QRКод.payload;
					//МенеджерЗаписи.qrcType = QRКод.qrcType;	
					МенеджерЗаписи.Записать();
				КонецЕсли;
				
			КонецЦикла;
			//Get Qr Codes Payment Status  
		КонецЕсли;
		
	КонецЦикла;
	//проверим набор ключей на изменение
	КлючиИзменены = Ложь;
	Если СтарыйНаборКлючей.sbp_accesstoken_hybrid <> Данные.НаборКлючей.sbp_accesstoken_hybrid Тогда
		КлючиИзменены = Истина;
	ИначеЕсли СтарыйНаборКлючей.sbp_accesstoken_client <> Данные.НаборКлючей.sbp_accesstoken_client Тогда
		КлючиИзменены = Истина;
	ИначеЕсли СтарыйНаборКлючей.sbp_refreshtoken_hybrid <> Данные.НаборКлючей.sbp_refreshtoken_hybrid Тогда
		КлючиИзменены = Истина;
	ИначеЕсли СтарыйНаборКлючей.sbp_client_id <> Данные.НаборКлючей.sbp_client_id Тогда
		КлючиИзменены = Истина;	
	ИначеЕсли СтарыйНаборКлючей.sbp_client_secret <> Данные.НаборКлючей.sbp_client_secret Тогда
		КлючиИзменены = Истина;	
	ИначеЕсли СтарыйНаборКлючей.sbp_account_code <> Данные.НаборКлючей.sbp_account_code Тогда
		КлючиИзменены = Истина;
	ИначеЕсли СтарыйНаборКлючей.sbp_merchant_id <> Данные.НаборКлючей.sbp_merchant_id Тогда
		КлючиИзменены = Истина;
	ИначеЕсли СтарыйНаборКлючей.sbp_legalId <> Данные.НаборКлючей.sbp_legalId Тогда
		КлючиИзменены = Истина;
	ИначеЕсли СтарыйНаборКлючей.sbp_customerCode <> Данные.НаборКлючей.sbp_customerCode Тогда
		КлючиИзменены = Истина;
	КонецЕсли;
	
	Если КлючиИзменены Тогда
		УстановитьПривилегированныйРежим(Истина);
		ЗаписатьНовыйНаборКлючейСБП(Данные.НаборКлючей);
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	//Создадим документы ПоступлениеНаРС по тем QR которые в статусе Accepted и не создан документ поступлениена РС
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	*
	|ИЗ
	|	РегистрСведений.СБП_QRКоды КАК СБП_QRКоды
	|ГДЕ
	|	СБП_QRКоды.status = ""Accepted""
	|	И СБП_QRКоды.ПоступлениеНаРС = ЗНАЧЕНИЕ(Документ.ПоступлениеНаРасчетныйСчет.ПустаяСсылка)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаЗапроса =  РезультатЗапроса.Выбрать();
	
	Пока ВыборкаЗапроса.Следующий() Цикл 	 
		ДанныеQR = Новый Структура("qrcId, status, ДатаГенерации, amount, qrcType, Заказ, ПоступлениеНаРС, createdAt, commissionPercent, paymentPurpose");
		ЗаполнитьЗначенияСвойств(ДанныеQR, ВыборкаЗапроса);
		ПолучитьДанныеQRКодаИзБанка(Данные, ДанныеQR);
		
		//поменяем статус заказа
		Заказ = ДанныеQR.Заказ.Ссылка;
		Если Заказ.ТекущийСтатус = Справочники.СтатусыЗаказовПокупателей.Отменен ИЛИ  
			Заказ.ТекущийСтатус = Справочники.СтатусыЗаказовПокупателей.Новый Тогда
			ЗаказОбъект = ДанныеQR.Заказ.Ссылка.ПолучитьОбъект();
			Попытка
				ЗаказОбъект.ТекущийСтатус = Справочники.СтатусыЗаказовПокупателей.ВРаботе;
				ЗаказОбъект.Записать(РежимЗаписиДокумента.Проведение); 	
			Исключение
				Инфо1 = ОписаниеОшибки();
				Инфо2 = ИнформацияОбОшибке();
				
				Инфо = Инфо1 + "
				|" + Инфо2.Описание + "
				|" + ?(Инфо2.Причина = Неопределено, "", Инфо2.Причина.Описание);
				
				ЗаписьЖурналаРегистрации("Изменение статуса документа Заказ покупателя, в связи с оплатой по QR", УровеньЖурналаРегистрации.Ошибка,,,Инфо);
			КонецПопытки;
		КонецЕсли; 
		
		//Создадим документ ПоступлениеНаРС
		ПоступлениеНаРС = СоздатьДокументПоступлениеНаРС(ДанныеQR);
		Если ЗначениеЗаполнено(ПоступлениеНаРС) Тогда
			//запишем в РС созданный документ 
			МенеджерЗаписи = РегистрыСведений.СБП_QRКоды.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.qrcId = ВыборкаЗапроса.qrcId;
			МенеджерЗаписи.Прочитать();
			Если МенеджерЗаписи.Выбран() Тогда
				ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ВыборкаЗапроса);
				МенеджерЗаписи.ПоступлениеНаРС = ПоступлениеНаРС;
				МенеджерЗаписи.Записать();
			КонецЕсли;
			
			
			//пробьём чек на кассе Атолл-онлайн
			ОбработкаСБПКасса = Обработки.СБПКасса.Создать();
			ОбработкаСБПКасса.СоздатьЧекСПроверкойНаСуществующий(ПоступлениеНаРС.Ссылка, "Приход");
		КонецЕсли;	
	КонецЦикла; 
	
	
	//удаляем отработанные QR коды
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	*
	|ИЗ
	|	РегистрСведений.СБП_QRКоды КАК СБП_QRКоды
	|ГДЕ
	|	СБП_QRКоды.ДатаГенерации <= &КонтрольнаяДата";
	
	Запрос.УстановитьПараметр("КонтрольнаяДата", ТекущаяДата()-259200); //время жизни QR кода 72 часа, QR коды старше 72 часов удаляем
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаЗапроса =  РезультатЗапроса.Выбрать();
	
	Пока ВыборкаЗапроса.Следующий() Цикл 		
		Запись = РегистрыСведений.СБП_QRКоды.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, ВыборкаЗапроса);
		Запись.Прочитать();
		Запись.Удалить();
	КонецЦикла;    
	
	
КонецФункции	

Функция ПолучитьQRКод(Данные) 
	
	ТекстС = "Запуск API Точка банк. Запрос QR - кода";
	//Сообщить(ТекстС);
	ЗаписьЖурналаРегистрации(ТекстС, УровеньЖурналаРегистрации.Информация);
	
	//Register Qr Code
	СтрокаЗапроса = Данные.НаборКлючей.sbp_type_service + "/sbp/v1.0/qr-code/merchant/" + Данные.НаборКлючей.sbp_merchant_id + "/" + Данные.НаборКлючей.sbp_account_code + "";	
	
	СтруктураimageParams = Новый Структура;
	СтруктураimageParams.Вставить("width", 200);
	СтруктураimageParams.Вставить("height", 200);
	СтруктураimageParams.Вставить("mediaType", "image/png");
	
	СтруктураData = Новый Структура;
	СтруктураData.Вставить("merchantId", Данные.НаборКлючей.sbp_merchant_id);
	СтруктураData.Вставить("legalId", Данные.НаборКлючей.sbp_legalId);
	СтруктураData.Вставить("customerCode", Данные.НаборКлючей.sbp_customerCode);
	СтруктураData.Вставить("amount", Сумма*100); //сумма в копейках!!!!
	СтруктураData.Вставить("currency", "RUB");
	СтруктураData.Вставить("paymentPurpose", "Оплата заказа №" + Данные.Заказ.Номер +" от " + Данные.Заказ.Дата + " УИД " + Данные.Заказ.Ссылка.УникальныйИдентификатор());
	СтруктураData.Вставить("qrcType", "02");
	СтруктураData.Вставить("imageParams", СтруктураimageParams);
	СтруктураData.Вставить("sourceName", "string");
	
	BodyParams = Новый Структура;
	BodyParams.Вставить("Data", СтруктураData);
	
	СтрокаJSON = СформироватьСтрокуJSONИзСтруктуры(BodyParams);
	
	HTTPОтвет = ПолучитьЗапрошенныйФайлPOST(СтрокаЗапроса, СтрокаJSON, , Данные.НаборКлючей.sbp_accesstoken_hybrid, Данные.НаборКлючей.sbp_account_code, Данные.НаборКлючей.sbp_url_service, Данные.НаборКлючей.sbp_port_service);
	
	//ОтветСтрокой = HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8");
	
	ОтветСтрокой = БОНД_Коннектор.КакТекст(HTTPОтвет);
	
	Текст = "Запрос Точка банк. Получение QR-кода. Код состояния: " + HTTPОтвет.КодСостояния + ". Входящая информация: " + ОтветСтрокой + "";
	
	Ответ = ОпределитьОтвет(HTTPОтвет, Текст, ОтветСтрокой);
	
	Если СтрНайти(ОтветСтрокой,"token is missing") > 0 Тогда //токен не рабочий, обновляем его
		
		Данные.НаборКлючей = ЗначениеИзСтрокиВнутр(ЗначениеВСтрокуВнутр(ОбновитьТокенAPIБанкТочка(Данные.НаборКлючей)));
		
		HTTPОтвет = ПолучитьЗапрошенныйФайлPOST(СтрокаЗапроса, СтрокаJSON, , Данные.НаборКлючей.sbp_accesstoken_hybrid, Данные.НаборКлючей.sbp_account_code, Данные.НаборКлючей.sbp_url_service, Данные.НаборКлючей.sbp_port_service);
		
		//ОтветСтрокой = HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8");
		
		ОтветСтрокой = БОНД_Коннектор.КакТекст(HTTPОтвет);
		
		Текст = "Запрос Точка банк. Получение QR-кода. Код состояния: " + HTTPОтвет.КодСостояния + ". Входящая информация: " + ОтветСтрокой + "";
		
		Ответ = ОпределитьОтвет(HTTPОтвет, Текст, ОтветСтрокой);
		
	КонецЕсли;
	
	qrcId = Ответ.Data.qrcId;
	
	СтруктураQRкода = Новый Структура;
	СтруктураQRкода.Вставить("Заказ",Данные.Заказ);
	СтруктураQRкода.Вставить("qrcId",qrcId);
	СтруктураQRкода.Вставить("Статус","NotStarted");
	СтруктураQRкода.Вставить("ДатаГенерации",ТекущаяДата());
	СтруктураQRкода.Вставить("imageParams_width",Ответ.Data.image.width);
	СтруктураQRкода.Вставить("imageParams_height",Ответ.Data.image.height);
	СтруктураQRкода.Вставить("imageParams_mediaType",Ответ.Data.image.mediaType);
	СтруктураQRкода.Вставить("imageParams_content",Ответ.Data.image.content);
	СтруктураQRкода.Вставить("payload",Ответ.Data.payload);
	СтруктураQRкода.Вставить("qrcType","02");
	СтруктураQRкода.Вставить("amount",Сумма);
	
	Данные.Вставить("QRкод",СтруктураQRкода);
	Если ЗначениеЗаполнено(qrcId) Тогда
		Попытка
			МенеджерЗаписи = РегистрыСведений.СБП_QRКоды.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Заказ = Данные.Заказ;
			МенеджерЗаписи.qrcId = qrcId;
			МенеджерЗаписи.status = "NOT_STARTED";
			МенеджерЗаписи.ДатаГенерации = ТекущаяДата();
			МенеджерЗаписи.imageParams_width = Ответ.Data.image.width;
			МенеджерЗаписи.imageParams_height = Ответ.Data.image.height;
			МенеджерЗаписи.imageParams_mediaType = Ответ.Data.image.mediaType;
			Хранилище = Новый ХранилищеЗначения(Ответ.Data.image.content, Новый СжатиеДанных());
			МенеджерЗаписи.imageParams_content = Хранилище;
			МенеджерЗаписи.payload = Ответ.Data.payload;
			МенеджерЗаписи.qrcType = "02";
			МенеджерЗаписи.amount = Сумма;
			МенеджерЗаписи.Записать();
		Исключение
			Текст = "Ошибка выгрузки записи регистра сведений СБП_QRКоды: " + ОписаниеОшибки() + "";
			//Сообщить(Текст, СтатусСообщения.Важное);
			ЗаписьЖурналаРегистрации(Текст, УровеньЖурналаРегистрации.Ошибка);
		КонецПопытки;
	КонецЕсли;
	
	ДД = Base64Значение(imageParams_content);
	Картинка = Новый Картинка(ДД, Ложь);
	СсылкаНаКартинку = ПоместитьВоВременноеХранилище(Картинка, Новый УникальныйИдентификатор);
	
	Возврат Данные;
	
КонецФункции

Процедура ПолучитьДанныеQRКодаИзБанка(Данные, ДанныеQR) 
	
	ТекстС = "Запуск API Точка банк. Запрос QR - кода";
	//Сообщить(ТекстС);
	ЗаписьЖурналаРегистрации(ТекстС, УровеньЖурналаРегистрации.Информация);
	
	//Get Qr Code          https://enter.tochka.com/uapi/sbp/{apiVersion}/qr-code/{qrcId}
	СтрокаЗапроса = Данные.НаборКлючей.sbp_type_service + "/sbp/v1.0/qr-code/" + ДанныеQR.qrcId + "";	
	
	HTTPОтвет = ПолучитьЗапрошенныйФайлPOST(СтрокаЗапроса, "", "GET", Данные.НаборКлючей.sbp_accesstoken_hybrid, Данные.НаборКлючей.sbp_account_code, Данные.НаборКлючей.sbp_url_service, Данные.НаборКлючей.sbp_port_service);
	
	//ОтветСтрокой = HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8");
	
	ОтветСтрокой = БОНД_Коннектор.КакТекст(HTTPОтвет);
	
	Текст = "Запрос Точка банк. Получение данных по QR-коду. Код состояния: " + HTTPОтвет.КодСостояния + ". Входящая информация: " + ОтветСтрокой + "";
	
	Ответ = ОпределитьОтвет(HTTPОтвет, Текст, ОтветСтрокой);
	
	Если СтрНайти(ОтветСтрокой,"token is missing") > 0 Тогда //токен не рабочий, обновляем его
		
		Данные.НаборКлючей = ЗначениеИзСтрокиВнутр(ЗначениеВСтрокуВнутр(ОбновитьТокенAPIБанкТочка(Данные.НаборКлючей)));
		
		HTTPОтвет = ПолучитьЗапрошенныйФайлPOST(СтрокаЗапроса, "", "GET", Данные.НаборКлючей.sbp_accesstoken_hybrid, Данные.НаборКлючей.sbp_account_code, Данные.НаборКлючей.sbp_url_service, Данные.НаборКлючей.sbp_port_service);
		
		//ОтветСтрокой = HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8");
		
		ОтветСтрокой = БОНД_Коннектор.КакТекст(HTTPОтвет);
		
		Текст = "Запрос Точка банк. Получение данных по QR-коду. Код состояния: " + HTTPОтвет.КодСостояния + ". Входящая информация: " + ОтветСтрокой + "";
		
		Ответ = ОпределитьОтвет(HTTPОтвет, Текст, ОтветСтрокой);
		
	КонецЕсли;
	
	ДанныеQR.commissionPercent = Ответ.Data.commissionPercent;
	ДанныеQR.paymentPurpose = Ответ.Data.paymentPurpose;
	
КонецПроцедуры

Функция ПолучитьQRКодПоЗаказу(Заказ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборКлючей = ПолучитьНаборКлючейДляСБП();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Данные = новый Структура("НаборКлючей, Заказ", НаборКлючей, Заказ);
	
	Если НаборКлючей = Неопределено Тогда
		Сообщить("По организации " + Заказ.Организация + " не настроена система быстрых платежей!", СтатусСообщения.Важное);
		Возврат Данные;
	КонецЕсли;
	
	СтарыйНаборКлючей = НаборКлючей; //запомним набор ключей, чтобы потом проверить на изменения
	
	Данные = ЗначениеИзСтрокиВнутр(ЗначениеВСтрокуВнутр(ПолучитьQRКод(Данные)));
	
	//проверим набор ключей на изменение
	КлючиИзменены = Ложь;
	Если СтарыйНаборКлючей.sbp_accesstoken_hybrid <> Данные.НаборКлючей.sbp_accesstoken_hybrid Тогда
		КлючиИзменены = Истина;
	ИначеЕсли СтарыйНаборКлючей.sbp_accesstoken_client <> Данные.НаборКлючей.sbp_accesstoken_client Тогда
		КлючиИзменены = Истина;
	ИначеЕсли СтарыйНаборКлючей.sbp_refreshtoken_hybrid <> Данные.НаборКлючей.sbp_refreshtoken_hybrid Тогда
		КлючиИзменены = Истина;
	ИначеЕсли СтарыйНаборКлючей.sbp_client_id <> Данные.НаборКлючей.sbp_client_id Тогда
		КлючиИзменены = Истина;	
	ИначеЕсли СтарыйНаборКлючей.sbp_client_secret <> Данные.НаборКлючей.sbp_client_secret Тогда
		КлючиИзменены = Истина;	
	ИначеЕсли СтарыйНаборКлючей.sbp_account_code <> Данные.НаборКлючей.sbp_account_code Тогда
		КлючиИзменены = Истина;
	ИначеЕсли СтарыйНаборКлючей.sbp_merchant_id <> Данные.НаборКлючей.sbp_merchant_id Тогда
		КлючиИзменены = Истина;
	ИначеЕсли СтарыйНаборКлючей.sbp_legalId <> Данные.НаборКлючей.sbp_legalId Тогда
		КлючиИзменены = Истина;
	ИначеЕсли СтарыйНаборКлючей.sbp_customerCode <> Данные.НаборКлючей.sbp_customerCode Тогда
		КлючиИзменены = Истина;
	КонецЕсли;
	
	Если КлючиИзменены Тогда
		УстановитьПривилегированныйРежим(Истина);
		ЗаписатьНовыйНаборКлючейСБП(Данные.НаборКлючей);
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат Данные;
КонецФункции

#КонецОбласти

#Область Запросы_POST_и_GET_к_http

Функция ОпределитьОтвет(HTTPОтвет, Текст, ОтветСтрокой)
	
	//Мас = Новый Массив;
	Отказ = Ложь;
	
	Если HTTPОтвет.КодСостояния <> 200 Тогда 
		//Сообщить(Текст, СтатусСообщения.Важное);
		ЗаписьЖурналаРегистрации(Текст, УровеньЖурналаРегистрации.Ошибка);
		Отказ = Истина;
	КонецЕсли;
	
	Структ = Новый Структура;
	
	Если Не Отказ Тогда
		Попытка
			ЧтениеJSON = Новый ЧтениеJSON; 	
			ЧтениеJSON.УстановитьСтроку(ОтветСтрокой);
			Структ = ПрочитатьJSON(ЧтениеJSON);
			Для Каждого ЭлСтр Из Структ Цикл
				Если ЗначениеЗаполнено(ЭлСтр.Значение) Тогда
					//Сообщить("" + ЭлСтр.Ключ + " " + ЭлСтр.Значение + "");
				КонецЕсли;
			КонецЦикла;
			ЧтениеJSON.Закрыть();
		Исключение
			Текст = "Ошибка выгрузки API Точка Банк: " + ОписаниеОшибки() + "";
			Сообщить(Текст, СтатусСообщения.Важное);
			ЗаписьЖурналаРегистрации(Текст, УровеньЖурналаРегистрации.Ошибка);
			Отказ = Истина;	
		КонецПопытки; 		
		
	КонецЕсли;
	
	Если Отказ = Истина Тогда			
		//Мас = Новый Массив;
		Сообщить(ОтветСтрокой);
	ИначеЕсли Найти(ОтветСтрокой, """error"":null") > 0 Или Найти(ОтветСтрокой, """errors"":null") > 0 Тогда
		//все ок	
	ИначеЕсли Найти(ОтветСтрокой, "errors") > 0 или Найти(ОтветСтрокой, "error") > 0 Тогда 
		//Мас = Новый Массив;
		Сообщить(ОтветСтрокой);
	КонецЕсли;
	
	Возврат Структ;
	
КонецФункции

Функция СформироватьСтрокуJSONИзСтруктуры(Объект)
	
	СтрокаJSON = "{";
	
	Для каждого Элемент Из Объект Цикл
		
		Если Элемент.Значение = "" Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаJSON = СтрокаJSON + """" + Элемент.Ключ + """" + ":";
		
		Если ТипЗнч(Элемент.Значение) = Тип("Строка") Тогда
			СтрокаJSON = СтрокаJSON + """" + Элемент.Значение + """";
			
		ИначеЕсли ТипЗнч(Элемент.Значение) = Тип("Число") Тогда
			СтрокаJSON = СтрокаJSON + СтрЗаменить(СтрЗаменить(Строка(Элемент.Значение), Символы.НПП, ""), ",", ".");
			
		ИначеЕсли ТипЗнч(Элемент.Значение) = Тип("Булево") Тогда
			СтрокаJSON = СтрокаJSON + Формат(Элемент.Значение, "БЛ=false; БИ=true");
			
		ИначеЕсли ТипЗнч(Элемент.Значение) = Тип("Дата") Тогда
			// преобразование в unixtime
			СтрокаJSON = СтрокаJSON + Формат(Элемент.Значение - Дата(1970,1,1,1,0,0), "ЧГ=0");
			
		ИначеЕсли ТипЗнч(Элемент.Значение) = Тип("Массив") Тогда
			СтрокаJSON = СтрокаJSON + СформироватьСтрокуJSON(Элемент.Значение);
			
		ИначеЕсли ТипЗнч(Элемент.Значение) = Тип("Структура") Тогда
			СтрокаJSON = СтрокаJSON + СформироватьСтрокуJSON(Элемент.Значение);
			
		ИначеЕсли ТипЗнч(Элемент.Значение) = Тип("ТаблицаЗначений") Тогда
			СтрокаJSON = СтрокаJSON + СформироватьСтрокуJSON(Элемент.Значение);
			
		Иначе
			//СтрокаJSON = СтрокаJSON + """" + URLEncode(Строка(Элемент.Значение)) + """";
			СтрокаJSON = СтрокаJSON + """" + Строка(Элемент.Значение) + """";
			
		КонецЕсли;
		
		СтрокаJSON = СтрокаJSON + ",";
		
	КонецЦикла;
	
	Если Прав(СтрокаJSON, 1) = "," Тогда
		СтрокаJSON = Лев(СтрокаJSON, СтрДлина(СтрокаJSON)-1);
	КонецЕсли;
	
	Возврат СтрокаJSON + "}";
	
КонецФункции

Функция ПреобразоватьвСистему(Число10,система) Экспорт
	
	Если система > 36 или система < 2 тогда
		Сообщить("Выбранная система исчисления не поддерживается");
		Возврат -1;
	КонецЕсли;
	
	СтрокаЗначений = "0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ";
	СтрокаСистема = "";
	Пока Число10 > 0 цикл
		РезДеления = Число10/система;
		ЧислоСистема = цел(РезДеления);
		остатокОтДеления = Число10 - система*(ЧислоСистема);
		СтрокаСистема = сред(СтрокаЗначений,остатокОтДеления+1,1)+ СтрокаСистема;
		Число10 = ?(ЧислоСистема=0,0,РезДеления); 
	КонецЦикла;
	
	Нечётное = стрДлина(СтрокаСистема) - цел(стрДлина(СтрокаСистема)/2)*2;
	Если Нечётное тогда
		СтрокаСистема = "0"+СтрокаСистема;
	КонецЕсли;
	
	Возврат СтрокаСистема;
	
КонецФункции

Функция URLEncode(стр) Экспорт  
	
	Длина=СтрДлина(Стр);
	Итог="";
	Для Н=1 По Длина Цикл
		Знак=Сред(Стр,Н,1);
		Код=КодСимвола(Знак);
		
		если ((Знак>="a")и(Знак<="z")) или
			((Знак>="A")и(Знак<="Z")) или
			((Знак>="0")и(Знак<="9")) тогда
			Итог=Итог+Знак;
		Иначе
			Если (Код>=КодСимвола("А"))И(Код<=КодСимвола("п")) Тогда
				Итог=Итог+"%"+ПреобразоватьвСистему(208,16)+"%"+ПреобразоватьвСистему(144+Код-КодСимвола("А"),16);
			ИначеЕсли (Код>=КодСимвола("р"))И(Код<=КодСимвола("я")) Тогда
				Итог=Итог+"%"+ПреобразоватьвСистему(209,16)+"%"+ПреобразоватьвСистему(128+Код-КодСимвола("р"),16);
			ИначеЕсли (Знак="ё") Тогда
				Итог=Итог+"%"+ПреобразоватьвСистему(209,16)+"%"+ПреобразоватьвСистему(145,16);
			ИначеЕсли (Знак="Ё") Тогда
				Итог=Итог+"%"+ПреобразоватьвСистему(208,16)+"%"+ПреобразоватьвСистему(129,16);
			Иначе
				Итог=Итог+"%"+ПреобразоватьвСистему(Код,16);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Возврат Итог;
	
КонецФункции

Функция СформироватьСтрокуJSONИзМассива(Объект)
	
	СтрокаJSON = "[";
	
	Для каждого Элемент Из Объект Цикл
		
		Если ТипЗнч(Элемент) = Тип("Строка") Тогда
			СтрокаJSON = СтрокаJSON + """" + Элемент + """";
			
		ИначеЕсли ТипЗнч(Элемент) = Тип("Число") Тогда
			СтрокаJSON = СтрокаJSON + СтрЗаменить(СтрЗаменить(Строка(Элемент), Символы.НПП, ""), ",", ".");
			
		ИначеЕсли ТипЗнч(Элемент) = Тип("Булево") Тогда
			СтрокаJSON = СтрокаJSON + Формат(Элемент, "БЛ=false; БИ=true");
			
		ИначеЕсли ТипЗнч(Элемент) = Тип("Дата") Тогда
			// преобразование в unixtime
			СтрокаJSON = СтрокаJSON + Формат(Элемент - Дата(1970,1,1,1,0,0), "ЧГ=0");
			
		ИначеЕсли ТипЗнч(Элемент) = Тип("Массив") Тогда
			СтрокаJSON = СтрокаJSON + СформироватьСтрокуJSON(Элемент);
			
		ИначеЕсли ТипЗнч(Элемент) = Тип("Структура") Тогда
			СтрокаJSON = СтрокаJSON + СформироватьСтрокуJSON(Элемент);
			
		ИначеЕсли ТипЗнч(Элемент) = Тип("ТаблицаЗначений") Тогда
			СтрокаJSON = СтрокаJSON + СформироватьСтрокуJSON(Элемент);
			
		Иначе
			//СтрокаJSON = СтрокаJSON + """" + URLEncode(Строка(Элемент)) + """";
			СтрокаJSON = СтрокаJSON + """" + Строка(Элемент) + """";
		КонецЕсли;
		
		СтрокаJSON = СтрокаJSON + ",";
	КонецЦикла;
	
	Если Прав(СтрокаJSON, 1) = "," Тогда
		СтрокаJSON = Лев(СтрокаJSON, СтрДлина(СтрокаJSON)-1);
	КонецЕсли;
	
	Возврат СтрокаJSON + "]";
	
КонецФункции

Функция СформироватьСтрокуJSON(Объект) Экспорт
	
	СтрокаJSON = "";
	
	Если ТипЗнч(Объект) = Тип("Массив") Тогда
		СтрокаJSON = СформироватьСтрокуJSONИзМассива(Объект);
		
	ИначеЕсли ТипЗнч(Объект) = Тип("Структура") Тогда
		СтрокаJSON = СформироватьСтрокуJSONИзСтруктуры(Объект);
		
	ИначеЕсли ТипЗнч(Объект) = Тип("ТаблицаЗначений") Тогда
		// преобразуем таблицу значений в массив структур - работает дольше, но кода меньше
		// если нужна скорость, то нужно отдельно обработать таблицу значений
		
		СоставСтруктуры = "";
		Для каждого Колонка Из Объект.Колонки Цикл
			СоставСтруктуры = СоставСтруктуры + ?(ЗначениеЗаполнено(СоставСтруктуры), ",", "") + Колонка.Имя;
		КонецЦикла;
		
		МассивСтрок = Новый Массив;
		Для каждого Строка Из Объект Цикл
			СтруктураКолонок = Новый Структура(СоставСтруктуры);
			ЗаполнитьЗначенияСвойств(СтруктураКолонок, Строка);
			МассивСтрок.Добавить(СтруктураКолонок);
		КонецЦикла;
		
		СтрокаJSON = СформироватьСтрокуJSONИзМассива(МассивСтрок);
		
	КонецЕсли;
	
	Возврат СтрокаJSON;
	
КонецФункции  

Функция УдалениеНечитаемыхСимволов( Знач Стр, ОграничитьДлину = 100)
	
	Стр = СокрЛП( Стр);
	
	Стр = СтрЗаменить( Стр, Символ(34), "");
	Стр = СтрЗаменить( Стр, "'", "");
	Стр = СтрЗаменить( Стр, ",", ".");
	
	СоответствиеНайден = Новый Соответствие;
	
	Для НомерСимвола = 1 по СтрДлина( Стр) Цикл
		
		ТекСимвол = Сред( Стр, НомерСимвола, 1);
		
		Если КодСимвола( ТекСимвол) < 32 И КодСимвола( ТекСимвол) <> 10 Тогда
			СоответствиеНайден.Вставить( ТекСимвол, "");
		КонецЕсли;
		
	КонецЦикла; // НомерСимвола = 1 по СтрДлина( Стр)
	
	Если СоответствиеНайден.Количество() > 0 Тогда
		Для Каждого ТекСимвол из СоответствиеНайден Цикл
			Стр = СтрЗаменить( Стр, ТекСимвол.Ключ, "");
		КонецЦикла;
	КонецЕсли; // ФлагНайден > 0
	
	Если СтрДлина( Стр) > ОграничитьДлину Тогда
		Стр = Лев( Стр, ОграничитьДлину);
	КонецЕсли;
	
	Возврат Стр;
	
КонецФункции

Функция ПолучитьЗапрошенныйФайлPOST(СтрокаЗапроса, СтрокаJSON, ТипЗапроса = "POST", access_token, account_code, url_service, port_service)
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type", "application/json; charset=utf-8");
	ЗаголовокHTTP.Вставить("accept", "application/json");
	ЗаголовокHTTP.Вставить("type", ТипЗапроса);
	ЗаголовокHTTP.Вставить("dataType", "json");
	ЗаголовокHTTP.Вставить("Authorization", "Bearer " + access_token);
	
	Попытка 
		//Соединение = Новый HTTPСоединение("enter.tochka.com", 443,,,,,Новый ЗащищенноеСоединениеOpenSSL); 
		//Соединение = Новый HTTPСоединение(url_service, port_service,,,,,Новый ЗащищенноеСоединениеOpenSSL);
		//HTTPЗапрос = Новый HTTPЗапрос(СтрокаЗапроса, ЗаголовокHTTP);
		Если ТипЗапроса = "POST" Тогда		
			//HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаJSON, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
			//ЧтениеJSON = Новый ЧтениеJSON;
			//ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
			//ДанныеJSON = ПрочитатьJSON(ЧтениеJSON, Ложь);
			ОтветСервера = БОНД_Коннектор.Post("https://" + url_service + "/" + СтрокаЗапроса, СтрокаJSON, Новый Структура("Заголовки",ЗаголовокHTTP));
			//ОтветСервера = Соединение.ОтправитьДляОбработки(HTTPЗапрос); 		
		Иначе
			ОтветСервера = БОНД_Коннектор.Get("https://" + url_service + "/" + СтрокаЗапроса, , Новый Структура("Заголовки",ЗаголовокHTTP));
			//ОтветСервера = Соединение.Получить(HTTPЗапрос);
		КонецЕсли;
		
	Исключение
		Инфо = ИнформацияОбОшибке(); 
		ТекстОшибки = "Связь с сервером не установлена " + ОписаниеОшибки() + "";
		Сообщить(ТекстОшибки, СтатусСообщения.Важное);
		ЗаписьЖурналаРегистрации(ТекстОшибки, УровеньЖурналаРегистрации.Ошибка);
		
	КонецПопытки;
	
	Возврат ОтветСервера;
	
КонецФункции

#КонецОбласти 

#Область Вспомогательные_процедуры_и_Функции

Функция СоздатьДокументПоступлениеНаРС(ДанныеПлатежа)
	
	Если ТипЗнч(ДанныеПлатежа) <> Тип("Структура") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	qrcId  = ДанныеПлатежа.qrcId;
	
	Если НЕ ЗначениеЗаполнено(qrcId) Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	Заказ = ДанныеПлатежа.Заказ;
	
	Если НЕ ЗначениеЗаполнено(Заказ) Тогда
		НайденЗаказ = ЛОЖЬ;
	Иначе
		НайденЗаказ = ИСТИНА;
	КонецЕсли;
	
	Если Не НайденЗаказ Тогда
		Текст = "Данный QR код не привязан к заказу" + qrcId + ", не возможно создать документ оплаты";
		ЗаписьЖурналаРегистрации(Текст, УровеньЖурналаРегистрации.Ошибка);	
		Возврат Неопределено;
	КонецЕсли;
	
	Если СтрНайти(ВРЕГ(ДанныеПлатежа.status), "ACCEPTED") = 0 Тогда
		Текст = "Данный QR код " + qrcId + " в статусе" + ДанныеПлатежа.status + ", не возможно создать документ оплаты";
		ЗаписьЖурналаРегистрации(Текст, УровеньЖурналаРегистрации.Ошибка);	
		Возврат Неопределено;
	КонецЕсли;
	
	Если НайденЗаказ Тогда
		Контрагент = Заказ.Контрагент;
	КонецЕсли;	
	
	СчетДляСБП = Константы.НВД_ОсновнойБанковскийСчетДляСБП.Получить();
	
	Если НЕ ЗначениеЗаполнено(СчетДляСБП) Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	СуммаПлатежа = ДанныеПлатежа.amount;  //в рублях
	
	Если НЕ ЗначениеЗаполнено(СуммаПлатежа) Тогда
		Текст = "У данный QR кода " + qrcId + " не указана сумма платежа, не возможно создать документ оплаты";
		ЗаписьЖурналаРегистрации(Текст, УровеньЖурналаРегистрации.Ошибка);
		Возврат Неопределено;
	КонецЕсли;
	
	//merchantId = ДанныеПлатежа.merchantId;
	
	Валюта = СчетДляСБП.Валюта;
	
	ДатаПлатежа = ТекущаяДата();
	
	//БанковскийСчетОтправителя = ДанныеПлатежа.
	Организация = Константы.НВД_ОсновнаяОрганизацияДляСБП.Получить();
	
	ПоступлениеНаРС = Документы.ПоступлениеНаРасчетныйСчет.СоздатьДокумент();
	ПоступлениеНаРС.Дата = ДатаПлатежа;
	Если НайденЗаказ Тогда
		ПоступлениеНаРС.ДобавитьОснование(Заказ);
	КонецЕсли;
	ПоступлениеНаРС.Организация = Организация;
	ПоступлениеНаРС.Валюта = Валюта;
	ПоступлениеНаРС.ВидОперации = Перечисления.ВидыОперацийПоступлениеНаРасчетныйСчет.ОплатаОтПокупателя;	
	ПоступлениеНаРС.Контрагент = Контрагент;
	ПоступлениеНаРС.Договор = Контрагент.ОсновнойДоговор;
	//ПоступлениеНаРС.КомиссияБанка = Число(ДанныеПлатежа.commissionPercent)*СуммаПлатежа/100; 
	//ПоступлениеНаРС.СтатьяРасходов = Справочники.СтатьиДоходовИРасходов.ПрочиеРасходы;
	ПоступлениеНаРС.НазначениеПлатежа = ДанныеПлатежа.paymentPurpose;
	ПоступлениеНаРС.Комментарий = "Загружен из Банка " + "qrcId:" + ДанныеПлатежа.qrcId; 
	ПоступлениеНаРС.Подразделение = Справочники.Подразделения.НайтиПоНаименованию("Основной");
	ПоступлениеНаРС.СтатьяДоходов = Справочники.СтатьиДоходовИРасходов.Продажи; 
	ПоступлениеНаРС.СтатьяДоходовПоНачислению = Справочники.СтатьиДоходовИРасходов.Продажи;
	ПоступлениеНаРС.Сумма = СуммаПлатежа;
	ПоступлениеНаРС.Счет = СчетДляСБП; 
	ПоступлениеНаРС.Автор = Пользователи.ТекущийПользователь();
	ПоступлениеНаРС.ТипПлатежногоДокумента = Перечисления.ТипыПлатежныхДокументов.ПлатежноеПоручение;
	ПоступлениеНаРС.СтавкаНДС = УчетНДС.СтавкаНДСПоУмолчанию(Организация);
	УчитыватьНДС = УчетНДС.ОрганизацияЯвляетсяПлательщикомНДС(Организация);
	ФинансыКлиентСервер.ПересчитатьСуммуНДС(ПоступлениеНаРС, УчитыватьНДС); 
	ПоступлениеНаРС.СозданПриИспользованииПодразделений = ИСТИНА;
	ПоступлениеНаРС.Подразделение = Заказ.Подразделение;
	
	ЗаполнитьПоЗаказуПокупателя(ПоступлениеНаРС, Заказ);
	
	СтрокиРаспределения = ОбщегоНазначения.ТаблицаЗначенийВМассив(ПоступлениеНаРС.РаспределениеПлатежа.Выгрузить());
	Если СтрокиРаспределения.Количество() > 0 Тогда
		
		ОбработкаТабличныхЧастейВызовСервера.РаспределитьСуммуОплатыПоДокументам(СтрокиРаспределения, ПоступлениеНаРС.Сумма, ПоступлениеНаРС.Дата, ПоступлениеНаРС.Валюта);
	
		Для каждого ДанныеСтроки из СтрокиРаспределения Цикл
			ЗаполнитьЗначенияСвойств(ПоступлениеНаРС["РаспределениеПлатежа"][ДанныеСтроки.НомерСтроки - 1], ДанныеСтроки);
		КонецЦикла;

	Конецесли;
	
	////Изменим способ Платежа в заказе
	//НовыйСпособПлатежа = Справочники.СпособыОплатыЗаказа.QRкод;
	//НадоИзменитьСпособПлатежаВЗаказе = Ложь;
	//Если Заказ.СпособОплаты <> НовыйСпособПлатежа Тогда
	//	НадоИзменитьСпособПлатежаВЗаказе = Истина;
	//	ЗаказОбъект = Заказ.ПолучитьОбъект();
	//	ЗаказОбъект.СпособОплаты = НовыйСпособПлатежа;
	//КонецЕсли;

	Попытка
		ПоступлениеНаРС.Записать(РежимЗаписиДокумента.Проведение); 

		//Если НадоИзменитьСпособПлатежаВЗаказе Тогда
		//	ЗаказОбъект.Записать();
		//КонецЕсли;
		
		Возврат ПоступлениеНаРС.Ссылка;
		
	Исключение
		Инфо1 = ОписаниеОшибки();
		Инфо2 = ИнформацияОбОшибке();
		
		Инфо = Инфо1 + "
		|" + Инфо2.Описание + "
		|" + ?(Инфо2.Причина = Неопределено, "", Инфо2.Причина.Описание);
		
		ЗаписьЖурналаРегистрации("Запись документа оплаты по Call Back GPB", УровеньЖурналаРегистрации.Ошибка,,,Инфо);
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Процедура ЗаполнитьПоЗаказуПокупателя(ПоступлениеНаРС, ДанныеЗаполнения)
	
	МассивДокументов = Новый Массив;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		МассивДокументов.Добавить(ДанныеЗаполнения);		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Массив") Тогда
		МассивДокументов = ДанныеЗаполнения;
	Иначе
		Возврат;
	КонецЕсли;
	
	Документы.ЗаказПокупателя.ПроверитьВозможностьВводаНаОснованииЗаказа(МассивДокументов);
	
	Контрагент 		= МассивДокументов[0].Контрагент;
	Договор 		= МассивДокументов[0].ДоговорКонтрагента;
	Организация 	= МассивДокументов[0].Организация;
	Подразделение 	= МассивДокументов[0].Подразделение; //#5775 	
	Валюта 			= МассивДокументов[0].Валюта; //#7373
	
	ДобавлятьЗаказыВторогоПорядкаВРаспределение = НЕ Константы.НеДобавлятьЗаказыВторогоПорядкаВРаспределение.Получить();
	ДобавлятьДокументыПродажиПоЗаказам = ПолучитьФункциональнуюОпцию("ДобавлятьДокументПродажиПоЗаказуПриДобавленииЗаказаВРаспределение")
	И Константы.ВестиРасчетыПоЗаказамПоРТиУ.Получить();
	Для каждого ЭлементМассива из МассивДокументов Цикл
		Если Контрагент <> ЭлементМассива.Контрагент Тогда
			Текст = НСтр("ru = 'Контрагенты в выделенных документах различаются, создание документа невозможно'");			
			ВызватьИсключение Текст;
		КонецЕсли;
		
		ДобавитьОснование(ПоступлениеНаРС, ЭлементМассива);
		
		НоваяСтрока = ПоступлениеНаРС.РаспределениеПлатежа.Добавить();
		НоваяСтрока.Документ = ЭлементМассива;
		НоваяСтрока.Сумма = РегистрыНакопления.РасчетыПоЗаказам.ПолучитьОстатокДолгаПоЗаказу(НоваяСтрока.Документ); //ЭлементМассива.СуммаДокумента;				
		НоваяСтрока.СуммаВВалютеДокумента = НоваяСтрока.Сумма;
		Если ДобавлятьЗаказыВторогоПорядкаВРаспределение Тогда
			ФинансыСервер.ДобавитьОснованиеЗаказаВРаспределениеПлатежа(ЭлементМассива, ПоступлениеНаРС.РаспределениеПлатежа, Сумма);
		КонецЕсли;
	КонецЦикла;
	
	Сумма = ПоступлениеНаРС.РаспределениеПлатежа.Итог("Сумма");
	
	//#7709 
	//после определения суммы документа
	Если ДобавлятьДокументыПродажиПоЗаказам Тогда
		Для каждого ЭлементМассива из МассивДокументов Цикл
			ФинансыСервер.ДобавитьДокументыПродажиПоЗаказам(ПоступлениеНаРС, ЭлементМассива);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьОснование(ПоступлениеНаРС, ДанныеЗаполнения) Экспорт
	
	НайденныеСтроки = ПоступлениеНаРС.Основания.НайтиСтроки(Новый Структура("Основание", ДанныеЗаполнения));
	Если  НайденныеСтроки.Количество() = 0 Тогда
		НоваяСтрока = ПоступлениеНаРС.Основания.Добавить();
		НоваяСтрока.Основание = ДанныеЗаполнения;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьЗаказПоНомеру(лТекстПлатежа)
	
	
	ТекстПлатежа = лТекстПлатежа;
	
	ТекстПлатежа = СтрЗаменить(ТекстПлатежа, "№", " ");
	ТекстПлатежа = СтрЗаменить(ТекстПлатежа, "СЧ.", " ");
	ТекстПлатежа = СтрЗаменить(ТекстПлатежа, "#", " ");      
	ТекстПлатежа = СтрЗаменить(ТекстПлатежа, "НОМЕР", " ");
	ТекстПлатежа = СтрЗаменить(ТекстПлатежа, "No", " ");
	ТекстПлатежа = СтрЗаменить(ТекстПлатежа, "NО", " ");
	ТекстПлатежа = СтрЗаменить(ТекстПлатежа, "NO", " ");      
	ТекстПлатежа = СтрЗаменить(ТекстПлатежа, "NO", " ");
	ТекстПлатежа = СтрЗаменить(ТекстПлатежа, ",", " ");
	ТекстПлатежа = СтрЗаменить(ТекстПлатежа, ";", " ");
	ТекстПлатежа = СтрЗаменить(ТекстПлатежа, "ОТ", " ");
	ТекстПлатежа = СтрЗаменить(ТекстПлатежа, "N", " ");
	ТекстПлатежа = СтрЗаменить(ТекстПлатежа, "P300-",  "Р300-");
	ТекстПлатежа = СтрЗаменить(ТекстПлатежа, "РЗ00-",  "Р300-");
	ТекстПлатежа = СтрЗаменить(ТекстПлатежа, "Р-300-", "Р300-");     
	ТекстПлатежа = СтрЗаменить(ТекстПлатежа, "Р 300-", "Р300-");
	ТекстПлатежа = СтрЗаменить(ТекстПлатежа, "P 300-", "Р300-");
	ТекстПлатежа = СтрЗаменить(ТекстПлатежа, " 300-",  " Р300-");
	ТекстПлатежа = СтрЗаменить(ТекстПлатежа, "Р600-",  "Р600-");
	ТекстПлатежа = СтрЗаменить(ТекстПлатежа, "P600-",  "Р600-");
	ТекстПлатежа = СтрЗаменить(ТекстПлатежа, "Р-600-", "Р600-");     
	ТекстПлатежа = СтрЗаменить(ТекстПлатежа, "Р 600-", "Р600-");
	ТекстПлатежа = СтрЗаменить(ТекстПлатежа, "P 600-", "Р600-");
	ТекстПлатежа = СтрЗаменить(ТекстПлатежа, " 600-",  " Р600-"); 
	ТекстПлатежа = СтрЗаменить(ТекстПлатежа, "P600-",  "Р600-");
	
	//Если СтрНайти(ТекстПлатежа, "300-") > 0 И СтрНайти(ТекстПлатежа, "Р") = 0 Тогда 
	//	ТекстПлатежа = СтрЗаменить(ТекстПлатежа, "300-",  " Р300-");	
	//КонецЕсли;	
	
	НомерЗаказа = "";
	
	Если СтрЧислоВхождений(ТекстПлатежа, "@") = 2 Тогда  //Сначала ищем заказ между собачками
		
		МасСлов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекстПлатежа, "@");  		
		
		Если МасСлов.Количество() = 3 Тогда
			НомерЗаказа = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(МасСлов[1], 11, "0");	
		КонецЕсли;
		
	КонецЕсли;   	
	
	СсылкаНаСчет = "";
	лСчет = "";
	Если Не ЗначениеЗаполнено(НомерЗаказа) Тогда //ищем счет
		
		МасСлов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекстПлатежа, " ", Истина);
		
		Для Каждого Эл Из МасСлов Цикл
			
			ЭлОбр = СтрЗаменить(Эл, "@", "");
			Если СтрЧислоВхождений(ЭлОбр, ".") = 1 Тогда //даты становятся номерами документов
				ЭлОбр = СтрЗаменить(ЭлОбр, ".", "");  		
			КонецЕсли;
			Если СтрДлина(ЭлОбр) = 11 Тогда
				лСчет = Документы.СчетНаОплатуКлиенту.НайтиПоНомеру(ЭлОбр, ТекущаяДата());
			КонецЕсли;
			
			Если ЗначениеЗаполнено(лСчет) Тогда
				СсылкаНаСчет = лСчет;	
			КонецЕсли;	
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НомерЗаказа)
		И Не ЗначениеЗаполнено(СсылкаНаСчет) Тогда //  Потом ищем по первому номеру в тексте, который подходит под условия
		
		МасСлов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекстПлатежа, " ", Истина); 
		Для Каждого Эл Из МасСлов Цикл
			
			//ЭлОбр = СтрЗаменить(Эл, "@", "");
			//Если СтрЧислоВхождений(ЭлОбр, ".") = 1 Тогда //даты становятся номерами документов
			//	ЭлОбр = СтрЗаменить(ЭлОбр, ".", "");  		
			//КонецЕсли;
			Если СтрДлина(ЭлОбр) >= 5 И СтрДлина(ЭлОбр) <= 6 И СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(ЭлОбр, Истина, Ложь) Тогда
				НомерЗаказа = СтроковыеФункцииКлиентСервер.ДополнитьСтроку(ЭлОбр, 11, "0");
				Если ЗначениеЗаполнено(НомерЗаказа) Тогда
					Прервать;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НомерЗаказа) Тогда
		СсылкаНаЗаказ = Документы.CRM_Событие.НайтиПоНомеру(НомерЗаказа);
	ИначеЕсли ЗначениеЗаполнено(СсылкаНаСчет) Тогда
		СсылкаНаЗаказ = СсылкаНаСчет.ДокументОснование;		
	иначе
		СсылкаНаЗаказ = Документы.CRM_Событие.ПустаяСсылка();	
	КонецЕсли;
	
	Возврат СсылкаНаЗаказ;
	
КонецФункции

Функция ПолучитьДатуИзСтроки(ДатаСтр)
	
	ДатаДокумента = Дата(Лев(ДатаСтр, 4), Сред(ДатаСтр, 6, 2), Сред(ДатаСтр, 9, 2), Сред(ДатаСтр, 12, 2), Сред(ДатаСтр, 15, 2), Сред(ДатаСтр, 18, 2));	
	
	Возврат ДатаДокумента;
	
КонецФункции

Функция ПолучитьКонтрагентаВладельца(лПартнер)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Контрагенты.Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Партнер = &Партнер
	|	И Контрагенты.Партнер <> ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)";	
	Запрос.УстановитьПараметр("Партнер", лПартнер);	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда	
		Возврат Выборка.Ссылка;
	Иначе	
		Возврат Справочники.Контрагенты.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

Функция ПолучитьМассивВсехНеОплаченныхQRКодов() 
	
	//за 1 раз можно запросить статусы не более 50 qr 
	//статус NOT_STARTED - по такому статусу не было запросов в банк, по таким статусам запрашиваем в первую очередь.
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ ПЕРВЫЕ 50
	//|	*
	//|ИЗ
	//|	РегистрСведений.СБП_QRКоды КАК СБП_QRКоды
	//|ГДЕ
	//|	СБП_QRКоды.status <> ""Accepted""
	//|   И СБП_QRКоды.status = ""NOT_STARTED""";
	//
	//ТЗQRКодов = Запрос.Выполнить().Выгрузить();
	//МассивQR = ТЗQRКодов.ВыгрузитьКолонку("qrcId");
	//
	//Если ТЗQRКодов.Количество() < 50 Тогда
	//	КоличествоЗапрашиваемыхQR = 50 - ТЗQRКодов.Количество();
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//	"ВЫБРАТЬ ПЕРВЫЕ " + КоличествоЗапрашиваемыхQR + " 
	//	|	*
	//	|ИЗ
	//	|	РегистрСведений.СБП_QRКоды КАК СБП_QRКоды
	//	|ГДЕ
	//	|	СБП_QRКоды.status <> ""Accepted""
	//	|   И НЕ СБП_QRКоды.qrcId В (&МассивQR)";
	//	
	//	Запрос.Параметры.Вставить("МассивQR", МассивQR); 
	//	ТЗQRКодов = Запрос.Выполнить().Выгрузить();		
	//	МассивQRДоп = ТЗQRКодов.ВыгрузитьКолонку("qrcId");
	//	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивQR,МассивQRДоп)
	//КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	*
	|ИЗ
	|	РегистрСведений.СБП_QRКоды КАК СБП_QRКоды
	|ГДЕ
	|	СБП_QRКоды.status <> ""Accepted""";
	
	ТЗQRКодов = Запрос.Выполнить().Выгрузить();
	МассивQR = ТЗQRКодов.ВыгрузитьКолонку("qrcId");
	
	Возврат МассивQR;
	
КонецФункции	

#КонецОбласти

Процедура ОбработкаЗаполнения()
	
КонецПроцедуры
